[
  {
    "slug": "welcome-to-omnifeed",
    "title": "Welcome to OmniFeed!",
    "description": "Discover the very first step into OmniFeed—a platform dedicated to delivering the most relevant and exciting tech updates, trends, and insights.",
    "content": "<p>We’re thrilled to have you here. OmniFeed is your destination for engaging stories and updates on technology, food, world news, travel, business, and jobs. Whether you’re stopping by to read the latest trends or to satisfy your curiosity, there’s something for everyone. Explore, connect, and be inspired—thank you for choosing to be part of the OmniFeed community!</p>",
    "author": "OmniFeed Team",
    "publishedAt": "2024-08-02T10:00:00Z",
    "featuredImage": "/omnifeed/images/cover-image.png",
    "category": "tech",
    "tags": ["welcome", "launch", "technology"],
    "featured": true
  },
  {
    "slug": "total-station-surveyor-job",
    "title": "Hiring: Total Station Surveyor",
    "description": "We are looking for a skilled Total Station Surveyor with at least 3 years of experience to join our team. If you have strong technical skills in survey equipment setup, data collection, and construction layout, we encourage you to apply.",
    "content": "<h1>Join Our Team as a Total Station Surveyor</h1><p>We are seeking an experienced and detail-oriented Total Station Surveyor to support our land surveying operations. This role is ideal for someone who is proficient with modern surveying technology and enjoys working in the field. The successful candidate will be responsible for conducting site surveys, setting out construction projects, and ensuring the accuracy of all measurements.</p><h2>Key Responsibilities:</h2><ul><li>Set up and operate Total Station and GPS equipment.</li><li>Collect and process survey data.</li><li>Perform construction stakeouts and as-built surveys.</li><li>Collaborate with engineers and construction teams.</li></ul>",
    "author": "HR Team",
    "publishedAt": "2024-07-31T12:00:00Z",
    "featuredImage": "/omnifeed/images/generated-image.png",
    "category": "jobs",
    "tags": ["surveying", "total station", "civil engineering", "job opening", "field work"],
    "featured": false
  }
]
